SIM_CONFIG <- list(

  ## ========= Monte Carlo =========
  B = 1000,
  n = 300,
  Distribution = "Exp",
  truncation = 0.1, # 10%, 30%
  censor = 0.2,  # 20%, 40%

  ## ========= 分布参数 =========
  Lambda = 0.3,
  V = 0.5,                 # Weibull shape
  Coeff = list(a =0.3, b = 3.0),

  ## ========= 真值参数 =========
  p = 2,
  eta = 2,  # 变点参数
  Beta = c(-1,-1), # 变点前的回归系数 (β₁, β₂)
  Gamma = c(0.9,0.5),  # 变点后的效应变化量  2 1 ➡️ 1.5 1 ➡️ 1.2 1 调低一点 ➡️ 1.2 0.8

  ## ========= 协变量分布 =========
  x1.mean = 2,
  x1.sd   = 0.5,  # 小一点 1.5 ➡️ 1 ➡️ 0.8
  x2.mean = 0,
  x2.sd   = 1,

  ## ========= SUP 检验参数 =========
  k = 5,                  # 变点候选网格数 |H|
  eta.trim = 0.01,        # 去除两端极端点比例
  B_perm = 1000,           # 每次检验的置换次数

  ## ========= 显著性水平 =========
  alpha = c(0.10, 0.05, 0.01),

  ## ========= RNG 控制 =========
  base_seed = 123,
  seed_multiplier = 4567
)

